noble-dreamer/ESP32-S3/main/app_ui.c
#include "app_ui.h"
#include "audio_player.h"
#include "esp32_s3_szp.h"
#include "file_iterator.h"
#include "string.h"
#include <dirent.h>
#include "bt/ble_hidd_demo.h"
#include "esp_wifi.h"
#include "freertos/event_groups.h"
#include "esp_event.h"
#include <sys/stat.h>
#include <time.h>
#include <sys/time.h>
#include "esp_netif_sntp.h"
#include "esp_sntp.h"
#include <ctype.h>

static const char *TAG = "app_ui";
// #define LV_USE_GIF 1
LV_FONT_DECLARE(font_alipuhui20);

lv_obj_t *main_obj;        // 主界面
lv_obj_t *main_text_label; // 主界面 欢迎语
lv_obj_t *icon_in_obj;     // 应用界面
int icon_flag;             // 标记现在进入哪个应用 在主界面时为0

/*********************** 开机界面 ****************************/
lv_obj_t *tanglong_img;

// // 设置角度的回调函数
// static void set_angle(void * img, int32_t v)
// {
//     lv_img_set_angle(img, v); // 设置图片的旋转角度
// }
// // 开机界面
void lv_gui_start(void)
{
    lvgl_port_lock(0);
    // 显示logo
    LV_IMG_DECLARE(tanglong)
    // LV_IMG_DECLARE(image_tanglong_img);  // 声明图片
    tanglong_img = lv_gif_create(lv_scr_act());        // 创建图片对象
    lv_gif_set_src(tanglong_img, &tanglong);           // 设置图片对象的图片源
    lv_obj_align(tanglong_img, LV_ALIGN_CENTER, 0, 0); // 设置图片位置为屏幕正中心
    // lv_img_set_pivot(tanglong_img, 60, 60); // 设置图片围绕自己的中心位置旋转

    // // 设置旋转动画
    // lv_anim_t a; // 创建动画变量
    // lv_anim_init(&a); // 初始化动画变量
    // lv_anim_set_var(&a, tanglong_img); // 动画变量赋值为logo图片
    // lv_anim_set_exec_cb(&a, set_angle); // 创建设置角度的回调函数
    // lv_anim_set_values(&a, 0, 3600); // 设置动画旋转角度的开始值和结尾值
    // lv_anim_set_time(&a, 200); // 设置转一圈的周期是200毫秒
    // lv_anim_set_repeat_count(&a, 5); // 设置旋转5次
    // lv_anim_start(&a); // 动画开始
    lvgl_port_unlock();
}

/******************************** 第1个图标 姿态传感器 应用程序*************************************************************************************/
lv_obj_t *label_x; // x角度值
lv_obj_t *label_y; // y角度值
lv_obj_t *label_z; // z角度值
lv_obj_t *x_bar;   // x角度bar
lv_obj_t *y_bar;   // y角度bar
lv_obj_t *z_bar;   // z角度bar

lv_obj_t *att_label; // 标题栏文字

lv_timer_t *my_lv_timer;

lv_obj_t *btn_att_back; // att姿态应用 后退按钮

// 返回主界面按钮事件处理函数
static void btn_att_back_cb(lv_event_t *e)
{
    lv_timer_del(my_lv_timer);
    qmi8658_close();         // 关闭芯片运行
    lv_obj_del(icon_in_obj); // 删除画布
    icon_flag = 0;
}

// 定时更新姿态角度值
void att_update_cb(lv_timer_t *timer)
{
    t_sQMI8658 QMI8658;
    int att_x, att_y, att_z;
    // 获取XYZ角度
    qmi8658_fetch_angleFromAcc(&QMI8658);
    att_x = round(QMI8658.AngleX); // 四舍五入
    att_y = round(QMI8658.AngleY); // 四舍五入
    att_z = round(QMI8658.AngleZ); // 四舍五入
    // 更新角度值
    lv_label_set_text_fmt(label_x, "X: %d", att_x);
    lv_label_set_text_fmt(label_y, "Y: %d", att_y);
    lv_label_set_text_fmt(label_z, "Z: %d", att_z);
    // 更新角度bar
    lv_bar_set_start_value(x_bar, att_x - 10, LV_ANIM_OFF);
    lv_bar_set_value(x_bar, att_x + 10, LV_ANIM_OFF);
    lv_bar_set_start_value(y_bar, att_y - 10, LV_ANIM_OFF);
    lv_bar_set_value(y_bar, att_y + 10, LV_ANIM_OFF);
    lv_bar_set_start_value(z_bar, att_z - 10, LV_ANIM_OFF);
    lv_bar_set_value(z_bar, att_z + 10, LV_ANIM_OFF);

    // 判断运动状态
    uint8_t status = qmi8658_fetch_motion();
    if (status & 0x20) // 判断是否发生Any-Motion
    {
        lv_label_set_text(att_label, "运动或震动");
    }
    else if (status & 0x40) // 判断是否发生No-Motion
    {
        lv_label_set_text(att_label, "静止");
    }
    else if (status & 0x80) // 判断是否发生Significant-Motion
    {
        lv_label_set_text(att_label, "剧烈运动");
    }
}

// 姿态监测处理任务
static void task_process_att(void *arg)
{
    esp_err_t ret = qmi8658_init();
    if (ret != ESP_OK)
    { // 如果传感器初始化不成功
        // 液晶屏提醒用户 传感器错误
        lvgl_port_lock(0);
        lv_obj_t *label = lv_label_create(icon_in_obj);
        lv_label_set_text(label, "QMI8658传感器错误...");
        lv_obj_set_style_text_color(label, lv_color_hex(0x000000), 0);
        lv_obj_set_style_text_font(label, &font_alipuhui20, 0);
        lv_obj_align(label, LV_ALIGN_CENTER, 0, 0);
        lvgl_port_unlock();
        vTaskDelay(1000 / portTICK_PERIOD_MS); // 提示词保留1秒
        lvgl_port_lock(0);
        lv_obj_del(icon_in_obj); // 删除画布 回到主界面
        lvgl_port_unlock();
    }
    else
    { // 传感器初始化成功
        lvgl_port_lock(0);
        // 显示x角度值
        label_x = lv_label_create(icon_in_obj);
        lv_label_set_text(label_x, "X:");
        lv_obj_set_style_text_color(label_x, lv_color_hex(0x000000), 0);
        lv_obj_set_style_text_font(label_x, &lv_font_montserrat_20, 0);
        lv_obj_align(label_x, LV_ALIGN_TOP_LEFT, 20, 60);
        // 显示x角度bar
        x_bar = lv_bar_create(icon_in_obj);
        lv_obj_set_size(x_bar, 200, 25);
        lv_obj_align(x_bar, LV_ALIGN_TOP_LEFT, 80, 60);
        lv_bar_set_mode(x_bar, LV_BAR_MODE_RANGE);
        lv_bar_set_range(x_bar, -101, 101);
        lv_bar_set_start_value(x_bar, -10, LV_ANIM_OFF);
        lv_bar_set_value(x_bar, 10, LV_ANIM_OFF);

        // 显示y角度值
        label_y = lv_label_create(icon_in_obj);
        lv_label_set_text(label_y, "Y:");
        lv_obj_set_style_text_color(label_y, lv_color_hex(0x000000), 0);
        lv_obj_set_style_text_font(label_y, &lv_font_montserrat_20, 0);
        lv_obj_align(label_y, LV_ALIGN_TOP_LEFT, 20, 120);
        // 显示y角度bar
        y_bar = lv_bar_create(icon_in_obj);
        lv_obj_set_size(y_bar, 200, 25);
        lv_obj_align(y_bar, LV_ALIGN_TOP_LEFT, 80, 120);
        lv_bar_set_mode(y_bar, LV_BAR_MODE_RANGE);
        lv_bar_set_range(y_bar, -101, 101);
        lv_bar_set_start_value(y_bar, -10, LV_ANIM_OFF);
        lv_bar_set_value(y_bar, 10, LV_ANIM_OFF);

        // 显示z角度值
        label_z = lv_label_create(icon_in_obj);
        lv_label_set_text(label_z, "Z:");
        lv_obj_set_style_text_color(label_z, lv_color_hex(0x000000), 0);
        lv_obj_set_style_text_font(label_z, &lv_font_montserrat_20, 0);
        lv_obj_align(label_z, LV_ALIGN_TOP_LEFT, 20, 180);
        // 显示z角度bar
        z_bar = lv_bar_create(icon_in_obj);
        lv_obj_set_size(z_bar, 200, 25);
        lv_obj_align(z_bar, LV_ALIGN_TOP_LEFT, 80, 180);
        lv_bar_set_mode(z_bar, LV_BAR_MODE_RANGE);
        lv_bar_set_range(z_bar, -101, 101);
        lv_bar_set_start_value(z_bar, -10, LV_ANIM_OFF);
        lv_bar_set_value(z_bar, 10, LV_ANIM_OFF);

