noble-dreamer/ESP32-S3/main/app_ui.c
// 播放SPIFFS中的MP3文件；用于开机音乐
void app_play_boot_mp3(const char *filepath)
{
    // 仅初始化一次
    static bool s_player_inited = false;
    if (!s_player_inited)
    {
        mp3_player_init();
        s_player_inited = true;
    }

    FILE *fp = fopen(filepath, "rb");
    if (!fp)
    {
        ESP_LOGE(TAG, "boot mp3 open failed: %s", filepath);
        // 如果打开失败，直接置位事件，避免系统卡住
        if (my_event_group)
        {
            xEventGroupSetBits(my_event_group, START_MUSIC_COMPLETED);
        }
        return;
    }

    g_boot_playing = true; // 在回调中依据该标志于播放结束置事件位
    audio_player_play(fp);
}

// 按钮样式相关定义
typedef struct
{
    lv_style_t style_bg;
    lv_style_t style_focus_no_outline;
} button_style_t;

static button_style_t g_btn_styles;

button_style_t *ui_button_styles(void)
{
    return &g_btn_styles;
}

// 按钮样式初始化
static void ui_button_style_init(void)
{
    /*Init the style for the default state*/
    lv_style_init(&g_btn_styles.style_focus_no_outline);
    lv_style_set_outline_width(&g_btn_styles.style_focus_no_outline, 0);

    lv_style_init(&g_btn_styles.style_bg);
    lv_style_set_bg_opa(&g_btn_styles.style_bg, LV_OPA_100);
    lv_style_set_bg_color(&g_btn_styles.style_bg, lv_color_make(255, 255, 255));
    lv_style_set_shadow_width(&g_btn_styles.style_bg, 0);
}

// 播放暂停按钮 事件处理函数
static void btn_play_pause_cb(lv_event_t *event)
{
    lv_obj_t *btn = lv_event_get_target(event);
    lv_obj_t *lab = (lv_obj_t *)btn->user_data;

    audio_player_state_t state = audio_player_get_state();
    printf("state=%d\n", state);
    if (state == AUDIO_PLAYER_STATE_IDLE)
    {
        lvgl_port_lock(0);
        lv_label_set_text_static(lab, LV_SYMBOL_PAUSE);
        lvgl_port_unlock();
        int index = file_iterator_get_index(file_iterator);
        ESP_LOGI(TAG, "playing index '%d'", index);
        play_index(index);
    }
    else if (state == AUDIO_PLAYER_STATE_PAUSE)
    {
        lvgl_port_lock(0);
        lv_label_set_text_static(lab, LV_SYMBOL_PAUSE);
        lvgl_port_unlock();
        audio_player_resume();
    }
    else if (state == AUDIO_PLAYER_STATE_PLAYING)
    {
        lvgl_port_lock(0);
        lv_label_set_text_static(lab, LV_SYMBOL_PLAY);
        lvgl_port_unlock();
        audio_player_pause();
    }
}

// 上一首 下一首 按键事件处理函数
static void btn_prev_next_cb(lv_event_t *event)
{
    bool is_next = (bool)event->user_data;

    if (is_next)
    {
        ESP_LOGI(TAG, "btn next");
        file_iterator_next(file_iterator);
    }
    else
    {
        ESP_LOGI(TAG, "btn prev");
        file_iterator_prev(file_iterator);
    }
    // 修改当前的音乐名称
    int index = file_iterator_get_index(file_iterator);
    lvgl_port_lock(0);
    lv_dropdown_set_selected(music_list, index);
    // lv_obj_t *label_title = (lv_obj_t *) music_list->user_data;
    // lv_label_set_text_static(label_title, file_iterator_get_name_from_index(file_iterator, index));
    lvgl_port_unlock();
    // 执行音乐事件
    audio_player_state_t state = audio_player_get_state();
    printf("prev_next_state=%d\n", state);
    if (state == AUDIO_PLAYER_STATE_IDLE)
    {
        // Nothing to do
    }
    else if (state == AUDIO_PLAYER_STATE_PAUSE)
    { // 如果当前正在暂停歌曲
        ESP_LOGI(TAG, "playing index '%d'", index);
        play_index(index);
        audio_player_pause();
    }
    else if (state == AUDIO_PLAYER_STATE_PLAYING)
    { // 如果当前正在播放歌曲
        // 播放歌曲
        ESP_LOGI(TAG, "playing index '%d'", index);
        play_index(index);
    }
}

// 音量调节滑动条 事件处理函数
static void volume_slider_cb(lv_event_t *event)
{
    lv_obj_t *slider = lv_event_get_target(event);
    int volume = lv_slider_get_value(slider); // 获取slider的值
    bsp_codec_volume_set(volume, NULL);       // 设置声音大小
    g_sys_volume = volume;                    // 把声音赋值给g_sys_volume保存
    ESP_LOGI(TAG, "volume '%d'", volume);
}

// 音乐列表 点击事件处理函数
static void music_list_cb(lv_event_t *event)
{
    uint16_t index = lv_dropdown_get_selected(music_list);
    ESP_LOGI(TAG, "switching index to '%d'", index);
    file_iterator_set_index(file_iterator, index);

    audio_player_state_t state = audio_player_get_state();
    lv_obj_set_style_text_font(music_list, &font_alipuhui20, 0);
    lv_obj_set_style_text_font(music_list, &font_alipuhui20, LV_PART_SELECTED);
    
    if (state == AUDIO_PLAYER_STATE_PAUSE)
    { // 如果当前正在暂停歌曲
        play_index(index);
        audio_player_pause();
    }
    else if (state == AUDIO_PLAYER_STATE_PLAYING)
    { // 如果当前正在播放歌曲
        play_index(index);
    }
}

static int classify_extension_ci(const char *ext);
// 音乐名称加入列表
static void build_file_list(lv_obj_t *music_list)
{
    lvgl_port_lock(0);
    lv_dropdown_clear_options(music_list);
    lvgl_port_unlock();

    for (size_t i = 0; i < file_iterator->count; i++)
    {
        const char *file_name = file_iterator_get_name_from_index(file_iterator, i);
        if (NULL != file_name)
        {
            lvgl_port_lock(0);
            // lv_dropdown_add_option(music_list, file_name, i); // 添加音乐名称到列表中
            const char *ext = strrchr(file_name, '.');
            if (ext!= NULL)
            {
                ext++; // 指向扩展名的第一个字符
                if (classify_extension_ci(ext) == 1)
                {
                    lv_dropdown_add_option(music_list, file_name, i); // 添加音乐名称到列表中
                }
                lvgl_port_unlock();
            }
        }
    }
    lvgl_port_lock(0);
    lv_dropdown_set_selected(music_list, 0); // 选择列表中的第一个
    lvgl_port_unlock();
}

// 播放器界面初始化
void music_ui(void)
{
    lvgl_port_lock(0);

    ui_button_style_init(); // 初始化按键风格

    /* 创建播放暂停控制按键 */
    btn_play_pause = lv_btn_create(icon_in_obj);
    lv_obj_align(btn_play_pause, LV_ALIGN_CENTER, 0, 40);
    lv_obj_set_size(btn_play_pause, 50, 50);
    lv_obj_set_style_radius(btn_play_pause, 25, LV_STATE_DEFAULT);
    lv_obj_add_flag(btn_play_pause, LV_OBJ_FLAG_CHECKABLE);

    lv_obj_add_style(btn_play_pause, &ui_button_styles()->style_focus_no_outline, LV_STATE_FOCUS_KEY);
    lv_obj_add_style(btn_play_pause, &ui_button_styles()->style_focus_no_outline, LV_STATE_FOCUSED);

