noble-dreamer/ESP32-S3/main/app_ui.c
    // 创建wifi信息列表
    wifi_list = lv_list_create(wifi_scan_page);
    lv_obj_set_size(wifi_list, 320, 200);
    lv_obj_align(wifi_list, LV_ALIGN_TOP_LEFT, 0, 40);
    lv_obj_set_style_border_width(wifi_list, 0, 0);
    lv_obj_set_style_text_font(wifi_list, &font_alipuhui20, 0);
    lv_obj_set_scrollbar_mode(wifi_list, LV_SCROLLBAR_MODE_OFF); // 隐藏wifi_list滚动条
    // 显示wifi信息
    lv_obj_t *btn;
    for (int i = 0; i < ap_number; i++)
    {
        ESP_LOGI(TAG, "SSID \t\t%s", ap_info[i].ssid); // 终端输出wifi名称
        ESP_LOGI(TAG, "RSSI \t\t%d", ap_info[i].rssi); // 终端输出wifi信号质量
        // 添加wifi列表
        btn = lv_list_add_btn(wifi_list, LV_SYMBOL_WIFI, (const char *)ap_info[i].ssid);
        lv_obj_add_event_cb(btn, list_btn_cb, LV_EVENT_CLICKED, NULL); // 添加点击回调函数
    }
    lvgl_port_unlock();

    // 创建wifi连接任务
    xQueueWifiAccount = xQueueCreate(2, sizeof(wifi_account_t));
    xTaskCreatePinnedToCore(wifi_connect, "wifi_connect", 4 * 1024, NULL, 5, NULL, 1); // 创建wifi连接任务
    vTaskDelete(NULL);
}

//  任务函数
static void wifiset_tips_task(void *pvParameters)
{
    // 显示扫描情况
    lvgl_port_lock(0);
    label_wifi_scan = lv_label_create(wifi_scan_page);
    lv_label_set_text(label_wifi_scan, "WLAN 已连接");
    lv_obj_set_style_text_color(label_wifi_scan, lv_color_hex(0x000000), 0);
    lv_obj_set_style_text_font(label_wifi_scan, &font_alipuhui20, 0);
    lv_obj_align(label_wifi_scan, LV_ALIGN_CENTER, 0, -50);
    lvgl_port_unlock();
    vTaskDelay(500 / portTICK_PERIOD_MS);
    lvgl_port_lock(0);
    lv_obj_del(wifi_scan_page);
    lvgl_port_unlock();

    vTaskDelete(NULL);
}

// 进入WIFI设置应用
static void wifiset_event_handler(lv_event_t *e)
{
    // 创建一个界面对象
    static lv_style_t style;
    lv_style_init(&style);
    lv_style_set_radius(&style, 10);
    lv_style_set_bg_opa(&style, LV_OPA_COVER);
    lv_style_set_bg_color(&style, lv_color_hex(0xFFFFFF));
    lv_style_set_border_width(&style, 0);
    lv_style_set_pad_all(&style, 0);
    lv_style_set_width(&style, 320);
    lv_style_set_height(&style, 240);

    wifi_scan_page = lv_obj_create(lv_scr_act());
    lv_obj_add_style(wifi_scan_page, &style, 0);

    // 判断wifi是否已连接
    int isconnect_flag = 1;
    if (s_wifi_event_group != NULL) // 如果创建了此事件组
    {
        // 查看是否已经连接wifi
        EventBits_t bits = xEventGroupWaitBits(s_wifi_event_group, WIFI_CONNECTED_BIT, pdFALSE, pdFALSE, 10);
        if (bits & WIFI_CONNECTED_BIT)
        { // 如果已经连接到wifi
            xTaskCreatePinnedToCore(wifiset_tips_task, "wifiset_tips_task", 2048, NULL, 5, NULL, 0);
        }
        else
        {
            isconnect_flag = 0;
        }
    }
    if (s_wifi_event_group == NULL || isconnect_flag == 0) // 没有连接到wifi
    {
        // 创建标题背景
        obj_scan_title = lv_obj_create(wifi_scan_page);
        lv_obj_set_size(obj_scan_title, 320, 40);
        lv_obj_set_style_pad_all(obj_scan_title, 0, 0); // 设置间隙
        lv_obj_align(obj_scan_title, LV_ALIGN_TOP_LEFT, 0, 0);
        lv_obj_set_style_bg_color(obj_scan_title, lv_color_hex(0x008b8b), 0);
        // 显示扫描情况
        label_wifi_scan = lv_label_create(obj_scan_title);
        lv_label_set_text(label_wifi_scan, "WLAN扫描中...");
        lv_obj_set_style_text_color(label_wifi_scan, lv_color_hex(0xffffff), 0);
        lv_obj_set_style_text_font(label_wifi_scan, &font_alipuhui20, 0);
        lv_obj_align(label_wifi_scan, LV_ALIGN_CENTER, 0, 0);

        icon_flag = 5; // 标记已经进入第5个应用

        xTaskCreatePinnedToCore(app_wifi_connect, "app_wifi_connect", 4 * 1024, NULL, 5, NULL, 0);
    }
}

/******************************** 第6个图标 蓝牙设置 应用程序***********************************************************************************/
lv_obj_t *ble_label;
lv_obj_t *btn_ble_back;

// 返回主界面按钮事件处理函数
static void btn_ble_back_cb(lv_event_t *e)
{
    bt_hid_end();
    lv_obj_del(icon_in_obj);
    icon_flag = 0;
}

// 进入蓝牙设置应用
static void btset_event_handler(lv_event_t *e)
{
    // 创建一个界面对象
    static lv_style_t style;
    lv_style_init(&style);
    lv_style_set_radius(&style, 10);
    lv_style_set_bg_opa(&style, LV_OPA_COVER);
    lv_style_set_bg_color(&style, lv_color_hex(0xffffff));
    lv_style_set_border_width(&style, 0);
    lv_style_set_pad_all(&style, 0);
    lv_style_set_width(&style, 320);
    lv_style_set_height(&style, 240);

    icon_in_obj = lv_obj_create(lv_scr_act());
    lv_obj_add_style(icon_in_obj, &style, 0);

    // 创建标题背景
    lv_obj_t *ble_title = lv_obj_create(icon_in_obj);
    lv_obj_set_size(ble_title, 320, 40);
    lv_obj_set_style_pad_all(ble_title, 0, 0); // 设置间隙
    lv_obj_align(ble_title, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_set_style_bg_color(ble_title, lv_color_hex(0xb87fa8), 0);
    // 显示标题
    ble_label = lv_label_create(ble_title);
    lv_label_set_text(ble_label, "蓝牙控制器");
    lv_obj_set_style_text_color(ble_label, lv_color_hex(0xffffff), 0);
    lv_obj_set_style_text_font(ble_label, &font_alipuhui20, 0);
    lv_obj_align(ble_label, LV_ALIGN_CENTER, 0, 0);
    // 创建后退按钮
    btn_ble_back = lv_btn_create(ble_title);
    lv_obj_align(btn_ble_back, LV_ALIGN_LEFT_MID, 0, 0);
    lv_obj_set_size(btn_ble_back, 60, 30);
    lv_obj_set_style_border_width(btn_ble_back, 0, 0);                          // 设置边框宽度
    lv_obj_set_style_pad_all(btn_ble_back, 0, 0);                               // 设置间隙
    lv_obj_set_style_bg_opa(btn_ble_back, LV_OPA_TRANSP, LV_PART_MAIN);         // 背景透明
    lv_obj_set_style_shadow_opa(btn_ble_back, LV_OPA_TRANSP, LV_PART_MAIN);     // 阴影透明
    lv_obj_add_event_cb(btn_ble_back, btn_ble_back_cb, LV_EVENT_CLICKED, NULL); // 添加按键处理函数

    lv_obj_t *label_back = lv_label_create(btn_ble_back);
    lv_label_set_text(label_back, LV_SYMBOL_LEFT); // 按键上显示左箭头符号
    lv_obj_set_style_text_font(label_back, &lv_font_montserrat_20, 0);
    lv_obj_set_style_text_color(label_back, lv_color_hex(0xffffff), 0);
    lv_obj_align(label_back, LV_ALIGN_CENTER, -10, 0);

    app_hid_ctrl();

    icon_flag = 6; // 标记已经进入第6个应用
}

/******************************** 第7个图标 图库设置 应用程序***********************************************************************************/
lv_obj_t *pic_title_label;
lv_obj_t *btn_pic_back;
lv_obj_t *img_in_obj;
static char g_img_path[128];

static file_iterator_instance_t *img_file_iterator = NULL;

static void btn_pic_back_cb(lv_event_t *e)
{
    lv_obj_del(icon_in_obj);
    icon_flag = 0;
}

static void btn_img_prev_next_cb(lv_event_t *e)
{
    bool is_next = (bool)lv_event_get_user_data(e);
    if (is_next)
    {
        ESP_LOGI(TAG, "Next Image");
        file_iterator_next(img_file_iterator);

