noble-dreamer/ESP32-S3/main/app_ui.c
    lv_obj_t *img1 = lv_img_create(icon1);
    LV_IMG_DECLARE(img_att_icon);
    lv_img_set_src(img1, &img_att_icon);
    lv_obj_align(img1, LV_ALIGN_CENTER, 0, 0);

    // 创建第2个应用图标
    lv_obj_t *icon2 = lv_btn_create(main_obj);
    lv_obj_add_style(icon2, &btn_style, 0);
    lv_obj_set_style_bg_color(icon2, lv_color_hex(0xf87c30), 0);
    lv_obj_set_pos(icon2, 120, 50);
    lv_obj_add_event_cb(icon2, music_event_handler, LV_EVENT_CLICKED, NULL);

    lv_obj_t *img2 = lv_img_create(icon2);
    LV_IMG_DECLARE(img_music_icon);
    lv_img_set_src(img2, &img_music_icon);
    lv_obj_align(img2, LV_ALIGN_CENTER, 0, 0);

    // 创建第3个应用图标
    lv_obj_t *icon3 = lv_btn_create(main_obj);
    lv_obj_add_style(icon3, &btn_style, 0);
    lv_obj_set_style_bg_color(icon3, lv_color_hex(0x008b8b), 0);
    lv_obj_set_pos(icon3, 225, 50);
    lv_obj_add_event_cb(icon3, sdcard_event_handler, LV_EVENT_CLICKED, NULL);

    lv_obj_t *img3 = lv_img_create(icon3);
    LV_IMG_DECLARE(img_sd_icon);
    lv_img_set_src(img3, &img_sd_icon);
    lv_obj_align(img3, LV_ALIGN_CENTER, 0, 0);

    // 创建第4个应用图标
    lv_obj_t *icon4 = lv_btn_create(main_obj);
    lv_obj_add_style(icon4, &btn_style, 0);
    lv_obj_set_style_bg_color(icon4, lv_color_hex(0xd8b010), 0);
    lv_obj_set_pos(icon4, 15, 147);
    lv_obj_add_event_cb(icon4, camera_event_handler, LV_EVENT_CLICKED, NULL);

    lv_obj_t *img4 = lv_img_create(icon4);
    LV_IMG_DECLARE(img_camera_icon);
    lv_img_set_src(img4, &img_camera_icon);
    lv_obj_align(img4, LV_ALIGN_CENTER, 0, 0);

    // 创建第5个应用图标
    lv_obj_t *icon5 = lv_btn_create(main_obj);
    lv_obj_add_style(icon5, &btn_style, 0);
    lv_obj_set_style_bg_color(icon5, lv_color_hex(0xcd5c5c), 0);
    lv_obj_set_pos(icon5, 120, 147);
    lv_obj_add_event_cb(icon5, wifiset_event_handler, LV_EVENT_CLICKED, NULL);

    lv_obj_t *img5 = lv_img_create(icon5);
    LV_IMG_DECLARE(img_wifiset_icon);
    lv_img_set_src(img5, &img_wifiset_icon);
    lv_obj_align(img5, LV_ALIGN_CENTER, 0, 0);

    // 创建第6个应用图标
    lv_obj_t *icon6 = lv_btn_create(main_obj);
    lv_obj_add_style(icon6, &btn_style, 0);
    lv_obj_set_style_bg_color(icon6, lv_color_hex(0xb87fa8), 0);
    lv_obj_set_pos(icon6, 225, 147);
    lv_obj_add_event_cb(icon6, btset_event_handler, LV_EVENT_CLICKED, NULL);

    lv_obj_t *img6 = lv_img_create(icon6);
    LV_IMG_DECLARE(img_btset_icon);
    lv_img_set_src(img6, &img_btset_icon);
    lv_obj_align(img6, LV_ALIGN_CENTER, 0, 0);

    // 创建第7个应用图标（位于第三行，需下滑可见）
    lv_obj_t *icon7 = lv_btn_create(main_obj);
    lv_obj_add_style(icon7, &btn_style, 0);
    lv_obj_set_style_bg_color(icon7, lv_color_hex(0x3c8dbc), 0);
    lv_obj_set_pos(icon7, 15, 244); // 第三行起始位置（超过 240 高度）

    lv_obj_add_event_cb(icon7, pic_event_handler, LV_EVENT_CLICKED, NULL);

    lv_obj_t *img7 = lv_img_create(icon7);
    LV_IMG_DECLARE(img_pic_icon);
    lv_img_set_src(img7, &img_pic_icon);
    lv_obj_align(img7, LV_ALIGN_CENTER, 0, 0);

    lvgl_port_unlock();
}
